/*====================================================================================
* File name: 	 ATD.c
* Description:  .  
* Created on:  01-12-2014
* Author:  JT
=======================================================================================
 History:
---------------------------------------------------------------------------------------
01-12-2014		Version 1.0.0       JT		Initialized version
-------------------------------------------------------------------------------------*/ 
#include <hidef.h>
#include "derivative.h"
#include "ATD.h"


/*************************************************************/
/*                      初始化AD模块                         */
/*************************************************************/       
void Init_ATD(void)
{
  ATD0DIEN_IEN0 = 0;
  ATD0DIEN_IEN1 = 0;
  ATD0DIEN_IEN2 = 0;
  ATD0DIEN_IEN3 = 0;
  ATD0CTL2 = 0x40;        //启动A/D转换,快速清零,中断DISABLE
// ATD0CTL2 = 0x42;       //启动A/D转换,快速清零,中断ENABLE
  ATD0CTL1_SRES = 0b10;   //选用12位模数转换
  ATD0CTL3 = 0xA0;        //每次转换4个通道，右对齐模式
  ATD0CTL4 = 0x84;        //采样时间12, fatdclk = fbus/(2*(prs+1))=40/2/5,
                          //AD模块时钟频率为4MHz
}                                          
 
/*************************************************************/
/*                      启动AD模块                           */
/*************************************************************/   
 void Start_ATD(void)
 {
   ATD0CTL5 = 0x30;    //转换AD00,1,2,3转换模式  
 }
 
