 /*====================================================================================
* File name: 	 pit.c
* Description:  .  
* Created on:  01-12-2014
* Author:  JT
=======================================================================================
 History:
---------------------------------------------------------------------------------------
01-12-2014		Version 1.0.0       JT		Initialized version
-------------------------------------------------------------------------------------*/
#include <hidef.h>
#include "derivative.h"
#include "pit.h"

/*************************************************************/
/*                      初始化周期性定时器                   */
/*************************************************************/        
 void Init_PIT(void)
 {
   PITMTLD0=249;     //为0通道8位计数器赋值
   PITLD0= 159;      //为0通道16位计数器赋值   
                     // Fbus= 40M  (249+1)*(159+1)=40000个总线周期=0.001秒
    
   PITMTLD1=249;     //为1通道8位计数器赋值
   PITLD1=19;        //为1通道16位计数器赋值   
                     //Fbus= 40M  (249+1)*(15+1)=4000个总线周期=0.0001秒
   
   
   PITMUX_PMUX0=0;   //第0通道使用微计数器0
   PITCE_PCE0=1;     //第0通道计数器工作 
   
   PITMUX_PMUX1=1;   //第1通道使用微计数器1
   PITCE_PCE1=1;     //第1通道计数器工作
   
   PITCFLMT=0x80;    //使能周期中断定时器
   
   PITINTE_PINTE0=1; //0通道定时器定时中断被使能
   PITINTE_PINTE1=1; //1通道定时器定时中断被使能                 
 }